Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1025DAB176.PIC
      <edc:SFRDef edc:_addr="0x1F8EA01C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDBPORCH" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDBPORCH" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BPORCHY" edc:desc="" edc:mask="0x7ff" edc:name="BPORCHY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="BPORCHX" edc:desc="" edc:mask="0x7ff" edc:name="BPORCHX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDCURSOR" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDCURSOR" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CURSORY" edc:desc="" edc:mask="0x7ff" edc:name="CURSORY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="CURSORX" edc:desc="" edc:mask="0x7ff" edc:name="CURSORX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EA024" edc:offset="0xc"/>
      <edc:SFRDef edc:_addr="0x1F8EA030" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="nn------nnnnnnnnnnnnnnnn----nnnn" edc:cname="GLCDL0MODE" edc:desc="" edc:impl="0xc0ffff0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------0000000000000000----0000" edc:name="GLCDL0MODE" edc:nzwidth="32" edc:por="00------0000000000000000----0000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COLORMODE" edc:desc="" edc:mask="0xf" edc:name="COLORMODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="SRCBLEND" edc:desc="" edc:mask="0xf" edc:name="SRCBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DESTBLEND" edc:desc="" edc:mask="0xf" edc:name="DESTBLEND" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="ALPHA" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MULALPHA" edc:desc="" edc:mask="0x1" edc:name="MULALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEALPHA" edc:desc="" edc:mask="0x1" edc:name="FORCEALPHA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISABIFIL" edc:desc="" edc:mask="0x1" edc:name="DISABIFIL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LAYEREN" edc:desc="" edc:mask="0x1" edc:name="LAYEREN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA034" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL0START" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL0START" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STARTY" edc:desc="" edc:mask="0x7ff" edc:name="STARTY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="STARTX" edc:desc="" edc:mask="0x7ff" edc:name="STARTX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA038" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="GLCDL0SIZE" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="GLCDL0SIZE" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIZEY" edc:desc="" edc:mask="0x7ff" edc:name="SIZEY" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIZEX" edc:desc="" edc:mask="0x7ff" edc:name="SIZEX" edc:nzwidth="11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA03C" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDL0BADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDL0BADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BASEADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA040" edc:_begin="0x24" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDL0STRIDE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="GLCDL0STRIDE" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRIDE" edc:desc="" edc:mask="0xffff" edc:name="STRIDE" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
